Repository: PureBasicCN/PureBasicPreference
Catalog: OmegaT/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: d = a + b ; we use the values stored in variables 'a' and 'b' and save the sum of them in 'd'
zh_cn: d = a + b ; 将变量 'a' 加 'b' 的和存储到变量 'd'

source: displays a description of the command-line arguments
zh_cn: 显示的命令行参数的描述

source: excluding borders (default).
zh_cn: 不包括边框 （默认值）。

source: excluding borders.
zh_cn: 不包括边框。

source: freak@purebasic.com
zh_cn: waitfordawn@qq.com

source: french/changes.htm
zh_cn: http://www.purebasic.comfrench/changes.php

source: french/download.htm
zh_cn: http://www.purebasic.com/french/download.php

source: french/faq.htm
zh_cn: http://www.purebasic.com/french/faq.php

source: french/index.htm
zh_cn: http://www.purebasic.com/french/index.php

source: french/links.htm
zh_cn: http://www.purebasic.com/french/links.php

source: french/news.htm
zh_cn: http://www.purebasic.comfrench/news.php

source: french/ordering.htm
zh_cn: http://www.purebasic.com/french/ordering.php

source: french/screenshots.htm
zh_cn: http://www.purebasic.com/french/screenshots.php

source: french/support.htm
zh_cn: http://www.purebasic.comfrench/support.php

source: german/changes.htm
zh_cn: http://www.purebasic.com/changes.php

source: german/download.htm
zh_cn: http://www.purebasic.com/download.php

source: german/faq.htm
zh_cn: http://www.purebasic.com/faq.php

source: german/index.htm
zh_cn: http://www.purebasic.com/index.php

source: german/links.htm
zh_cn: http://www.purebasic.com/links.php

source: german/news.htm
zh_cn: http://www.purebasic.com/news.php

source: german/ordering.htm
zh_cn: http://www.purebasic.com/ordering.php

source: german/screenshots.htm
zh_cn: http://www.purebasic.com/screenshots.php

source: german/support.htm
zh_cn: http://www.purebasic.com/support.php

source: http://forums.purebasic.com
zh_cn: http://www.purebasic.hk

source: http://www.purebasic.com
zh_cn: http://www.purebasic.cn

source: http://www.purebasic.fr/german
zh_cn: http://www.purebasic.hk/

source: http://www.spiderbasic.com
zh_cn: http://www.spiderbasic.cn

source: mail to André Beer
zh_cn: 发邮件漂流瓶儿

source: mail to Frederic Laboureur
zh_cn: 发邮件至麦壳饼

source: mail to Timo Harter
zh_cn: 发邮件至小半砖头

source: mail to Yann Vanlergerghe
zh_cn: 请加群6248988 联系他们

source: mailto:alphasnd@purebasic.com
zh_cn: mailto:100860505@qq.com

source: mailto:andre@purebasic.com
zh_cn: tsliuhaitao@qq.com

source: mailto:freak@purebasic.com
zh_cn: mailto:waitfordawn@qq.com

source: mailto:support@purebasic.com
zh_cn: mailto:100860505@qq.com

source: mailto:webmaster@purebasic.com
zh_cn: http://jq.qq.com/?_wv=1027&k=2GmwtDv

source: offlineordering.htm
zh_cn: http://www.purebasic.com/offlineordering.php

source: online ordering
zh_cn: 在线购买

source: onlineordering.htm
zh_cn: http://www.purebasic.com/onlineordering.php

source: optimized programming language
zh_cn: 已优化的编程语言

source: or a character was received after the end-of-file (EOF)
zh_cn: 或在文件尾 (EOF)之后接收到字符

source: pure basic support
zh_cn: PureBasic中文支持

source: purebasic (webmaster@purebasic.com), Frederic Laboureur, Frédéric Laboureur, Yann Vanlerberghe, Alphasnd, Alphasound, Fantaisie Software
zh_cn: purebasic (webmaster@purebasic.com), Frederic Laboureur, Frédéric Laboureur, Yann Vanlerberghe, Alphasnd, Alphasound, Fantaisie Software,PureBasic.CN ,麦壳饼,MysticBoy

source: purebasic,PUREBASIC,pure basic,PURE BASIC,basic,BASIC,compiler,COMPILER,language,LANGUAGE,programming,PROGRAMMING,optimized,OPTIMIZED,easy,EASY,programming language,basic programming language,basic compiler,BASIC COMPILER,visual basic compiler,easy programming language,optimized programming language, games, applications, game, application, buy, ordering, order, Fantaisie Software,pic basic compiler,c compiler,c++ compiler,compilers,qbasic compiler,asm,computer programming,c programming,game programming,programming languages,c,c++,java,visual c++,linux,windows,nt,VisualC++,LccWin32,VisualBasic,visual basic
zh_cn: purebasic,PUREBASIC,pure basic,PURE BASIC,basic,BASIC,compiler,COMPILER,language,LANGUAGE,programming,PROGRAMMING,optimized,OPTIMIZED,easy,EASY,programming language,basic编程语言,basic compiler,BASIC COMPILER,visual basic 编译器,简易编程语言,高度优化编程语言, games, 应用程序, 游戏, 应用, buy, ordering, 订单, Fantaisie Software,pic basic 编译器,c 编译器,c++ 编译器,编译器,qbasic 编译器,asm,计算机 编程,c 编程,游戏编程,编程语言,c,c++,java,visual c++,linux,windows,nt,VisualC++,LccWin32,VisualBasic,visual basic

source: random thoughts on PureBasic development
zh_cn: PureBasic开发随感

source: securedownload/Login.htm
zh_cn: http://www.purebasic.com/securedownload/Login.php

source: software,computers,programming,compilers,languages,basic
zh_cn: 软件,计算机,编程,编译器,语言,basic

source: visual basic compiler
zh_cn: visual basic 编译器

source: webmaster@purebasic.com
zh_cn: 100860505@qq.com

source: - Added Module, Dialog, Runtime and many more
zh_cn: - 增加模块，对话框，运行时以及更多

source: - Added VectorDrawing, CGI, HTTPS and much more
zh_cn: - 已添加 VectorDrawing, CGI, HTTPS 和更多

source: - Bug-fix release
zh_cn: - 错误修复版本

source: - Fixed some compiler and libraries bugs
zh_cn: - 修正了一些编译器和库的bug

source: - Major release
zh_cn: - 主要发布>

source: - Many new commands, integrated form designer, and much more...
zh_cn: - 许多新的命令，集成窗体设计器，以及更多...

source: 10, rue de Lausanne
zh_cn: 乌鲁木齐红山路

source: 67640 FEGERSHEIM
zh_cn: 新疆

source: FRANCE
zh_cn: 中国

source: To access your personal account and download the full versions of PureBasic click here:
zh_cn: 要访问您的个人帐户和下载 PureBasic 的完整版本，请单击此处︰

source: - Access to full OS API for advanced programmers
zh_cn: - 针对高级程序员支持完整的OSAPI访问

source: - All BASIC keywords are supported
zh_cn: - 所有 BASIC关键词都支持

source: - Dedicated editor and development environment
zh_cn: - 专用的编辑器和开发环境

source: - Easy and high quality 3D support based on OGRE
zh_cn: - 基于OGRE的方便和高质量的3D支持

source: - Easy but very fast 2D game support through dedicated libraries (DirectX, SDL, ...)
zh_cn: - 简单但是非常快速的2D游戏支持，通过专用库实现 (DirectX, SDL, ...)

source: - Full unicode support
zh_cn: - 完整的 unicode 支持

source: - Huge set of internal commands (1400+) to quickly and easily build any application or game
zh_cn: - 丰富的内部指令（1400+）可以快速且简单的创建应用和游戏

source: - No external DLLs, runtime interpreter or anything else required when creating executables
zh_cn: - 创建的可执行文件无需扩展DLL,运行库或其他任何必备因素。

source: - Optimal use of the available hardware by using highly optimized (assembly) commands
zh_cn: - 使用了高度优化的（汇编）指令进行了最佳的可用硬件优优化

source: - Powerful integrated debugger and profiler to easily trace and analyze code
zh_cn: - 功能强大的集成调试器和分析器可以轻松的跟踪和优化代码

source: - Procedure support for structured programming with local and global variables
zh_cn: - 过程支持本地和全局变量的结构编程

source: - Source code is portable between Windows, MacOS X and Linux
zh_cn: - 源代码在 Windows, MacOS X 和 Linux上通用

source: - Very fast compiler which creates highly optimized executables
zh_cn: - 非常快速的编译所创建的可执行文件也是高度优化了的。

source: Download a free demo-version of PureBasic 5.42:
zh_cn: 下载免费的PureBasic 5.42演示版本:

source: Download the full version of PureBasic 4.00 (OpenSource):
zh_cn: 下载完整版本的PureBasic 4.00 (开源):

source: Channel: purebasic (english)
zh_cn: QQ群:6248988

source: Servername: irc.freenode.net
zh_cn: 中文交流方式

source: French forum
zh_cn: 法语论坛

source: Official forum (english)
zh_cn: 官方论坛 (英文)

source: User comments
zh_cn: 用户评论

source: PureBasic-Demo.zip (x86 - 32 bit)
zh_cn: PureBasic-Demo.zip (x86 - 32 位)

source: German forum
zh_cn: 中文论坛

source: PureArea.net (PureBasic support site)
zh_cn: PureArea.net (PureBasic 支持网站)

source: PureBasic-Demo.zip (x64 - 64 bit)
zh_cn: PureBasic-Demo.zip (x64 - 64 位)

source: French catalog for purebasic 1.50
zh_cn: 法语 语言包for purebasic 1.50

source: German catalog for purebasic 2.90
zh_cn: 德语 语言包 for purebasic 2.90

source: Russian catalog for purebasic 1.50
zh_cn: 俄语 语言包 for purebasic 1.50

source: If the current output has an alpha channel, the drawing operations will only modify the color components and leave the alpha channel unchanged.
zh_cn: 如果当前输出具有 alpha 通道，绘图操作将只修改颜色分量并离开不变的 alpha 通道。
